# Centroid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Polyloop..::..Centroid Property
Polyloop Class See Also
---
The polygon centroid.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ Centroid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Centroid As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Centroid {
	XYZ^ get ();
}
```

# See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace